tap "farion1231/ccswitch"
brew "bat"
brew "eza"
brew "fd"
brew "gcc"
brew "maven"
brew "ripgrep"
brew "opencode"
brew "powerlevel10k"
brew "protobuf"
brew "rust"
brew "telnet"
brew "zoxide"
cask "android-platform-tools"
cask "another-redis-desktop-manager"
cask "cc-switch"
cask "docker-desktop"
cask "font-fira-code"
cask "picgo"
cask "snipaste"
cargo "create-tauri-app"
cargo "tauri-cli"
npm "@anthropic-ai/claude-code"
npm "@mi/mi-code-cli"
npm "@mi/o11y-cli"
npm "@mimocode/cli-ai"
npm "@openai/codex"
npm "cc-connect"
npm "corepack"
